Revit 2024 API
SolidSolidCutUtils.AddCutBetweenSolids Method (Document, Element, Element)
 Adds a solid-solid cut for the two elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static void AddCutBetweenSolids(
	Document document,
	Element solidToBeCut,
	Element cuttingSolid
)
Visual Basic
Public Shared Sub AddCutBetweenSolids ( _
	document As Document, _
	solidToBeCut As Element, _
	cuttingSolid As Element _
)
Visual C++
public:
static void AddCutBetweenSolids(
	Document^ document,
	Element^ solidToBeCut,
	Element^ cuttingSolid
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document containing the two elements.
solidToBeCut
Type: Autodesk.Revit.DB.Element
 The solid to be cut.
cuttingSolid
Type: Autodesk.Revit.DB.Element
 The cutting solid.
Remarks
 This utility will split faces of cutting solid by default.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The element must be in a project document or in a conceptual model, pattern based curtain panel, or adaptive component family. -or- The element does not meet the condition that it must be solid and must be a GenericForm, GeomCombination, or a FamilyInstance.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  Failed to add solid-solid cut for the two elements.
See Also
SolidSolidCutUtils Class
AddCutBetweenSolids Overload
Autodesk.Revit.DB Namespace